# Project 1: Explanatory Data Analysis & Data Presentation (Movies Dataset)

# Self-Coded

## Data Import and first Inspection

1. __Import__ the movies dataset from the CSV file "movies_complete.csv". __Inspect__ the data.

__Some additional information on Features/Columns__:

* **id:** The ID of the movie (clear/unique identifier).
* **title:** The Official Title of the movie.
* **tagline:** The tagline of the movie.
* **release_date:** Theatrical Release Date of the movie.
* **genres:** Genres associated with the movie.
* **belongs_to_collection:** Gives information on the movie series/franchise the particular film belongs to.
* **original_language:** The language in which the movie was originally shot in.
* **budget_musd:** The budget of the movie in million dollars.
* **revenue_musd:** The total revenue of the movie in million dollars.
* **production_companies:** Production companies involved with the making of the movie.
* **production_countries:** Countries where the movie was shot/produced in.
* **vote_count:** The number of votes by users, as counted by TMDB.
* **vote_average:** The average rating of the movie.
* **popularity:** The Popularity Score assigned by TMDB.
* **runtime:** The runtime of the movie in minutes.
* **overview:** A brief blurb of the movie.
* **spoken_languages:** Spoken languages in the film.
* **poster_path:** The URL of the poster image.
* **cast:** (Main) Actors appearing in the movie.
* **cast_size:** number of Actors appearing in the movie.
* **director:** Director of the movie.
* **crew_size:** Size of the film crew (incl. director, excl. actors).

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

df = pd.read_csv("movies_complete.csv")

## The best and the worst movies...

2. __Filter__ the Dataset and __find the best/worst n Movies__ with the

- Highest Revenue
- Highest Budget
- Highest Profit (=Revenue - Budget)
- Lowest Profit (=Revenue - Budget)
- Highest Return on Investment (=Revenue / Budget) (only movies with Budget >= 10) 
- Lowest Return on Investment (=Revenue / Budget) (only movies with Budget >= 10)
- Highest number of Votes
- Highest Rating (only movies with 10 or more Ratings)
- Lowest Rating (only movies with 10 or more Ratings)
- Highest Popularity

__Define__ an appropriate __user-defined function__ to reuse code.

__Movies Top 5 - Highest Revenue__

In [4]:
df.nlargest(5,'revenue_musd')

,id,title,tagline,release_date,genres,belongs_to_collection,original_language,budget_musd,revenue_musd,production_companies,...,vote_average,popularity,runtime,overview,spoken_languages,poster_path,cast,cast_size,crew_size,director
14448,19995,Avatar,Enter the World of Pandora.,2009-12-10,Action|Adventure|Fantasy|Science Fiction,Avatar Collection,en,237.0,2787.965087,Ingenious Film Partners|Twentieth Century Fox ...,...,7.2,185.070892,162.0,"In the 22nd century, a paraplegic Marine is di...",English|Español,<img src='http://image.tmdb.org/t/p/w185//btnl...,Sam Worthington|Zoe Saldana|Sigourney Weaver|S...,83,153,James Cameron
26265,140607,Star Wars: The Force Awakens,Every generation has a story.,2015-12-15,Action|Adventure|Science Fiction|Fantasy,Star Wars Collection,en,245.0,2068.223624,Lucasfilm|Truenorth Productions|Bad Robot,...,7.5,31.626013,136.0,Thirty years after defeating the Galactic Empi...,English,<img src='http://image.tmdb.org/t/p/w185//9rd0...,Daisy Ridley|John Boyega|Adam Driver|Harrison ...,84,113,J.J. Abrams
1620,597,Titanic,Nothing on Earth could come between them.,1997-11-18,Drama|Romance|Thriller,NaN,en,200.0,1845.034188,Paramount Pictures|Twentieth Century Fox Film ...,...,7.5,26.889070,194.0,"84 years later, a 101-year-old woman named Ros...",English|Français|Deutsch|svenska|Italiano|Pусский,<img src='http://image.tmdb.org/t/p/w185//9xjZ...,Kate Winslet|Leonardo DiCaprio|Frances Fisher|...,136,65,James Cameron
17669,24428,The Avengers,Some assembly required.,2012-04-25,Science Fiction|Action|Adventure,The Avengers Collection,en,220.0,1519.557910,Paramount Pictures|Marvel Studios,...,7.4,89.887648,143.0,When an unexpected enemy emerges and threatens...,English,<img src='http://image.tmdb.org/t/p/w185//RYMX...,Robert Downey Jr.|Chris Evans|Mark Ruffalo|Chr...,115,147,Joss Whedon
24812,135397,Jurassic World,The park is open.,2015-06-09,Action|Adventure|Science Fiction|Thriller,Jurassic Park Collection,en,150.0,1513.528810,Universal Studios|Amblin Entertainment|Legenda...,...,6.5,32.790475,124.0,Twenty-two years after the events of Jurassic ...,English,<img src='http://image.tmdb.org/t/p/w185//rhr4...,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,28,435,Colin Trevorrow

In [6]:
df.sort_values(by='revenue_musd',ascending=False).head(5)

,id,title,tagline,release_date,genres,belongs_to_collection,original_language,budget_musd,revenue_musd,production_companies,...,vote_average,popularity,runtime,overview,spoken_languages,poster_path,cast,cast_size,crew_size,director
14448,19995,Avatar,Enter the World of Pandora.,2009-12-10,Action|Adventure|Fantasy|Science Fiction,Avatar Collection,en,237.0,2787.965087,Ingenious Film Partners|Twentieth Century Fox ...,...,7.2,185.070892,162.0,"In the 22nd century, a paraplegic Marine is di...",English|Español,<img src='http://image.tmdb.org/t/p/w185//btnl...,Sam Worthington|Zoe Saldana|Sigourney Weaver|S...,83,153,James Cameron
26265,140607,Star Wars: The Force Awakens,Every generation has a story.,2015-12-15,Action|Adventure|Science Fiction|Fantasy,Star Wars Collection,en,245.0,2068.223624,Lucasfilm|Truenorth Productions|Bad Robot,...,7.5,31.626013,136.0,Thirty years after defeating the Galactic Empi...,English,<img src='http://image.tmdb.org/t/p/w185//9rd0...,Daisy Ridley|John Boyega|Adam Driver|Harrison ...,84,113,J.J. Abrams
1620,597,Titanic,Nothing on Earth could come between them.,1997-11-18,Drama|Romance|Thriller,NaN,en,200.0,1845.034188,Paramount Pictures|Twentieth Century Fox Film ...,...,7.5,26.889070,194.0,"84 years later, a 101-year-old woman named Ros...",English|Français|Deutsch|svenska|Italiano|Pусский,<img src='http://image.tmdb.org/t/p/w185//9xjZ...,Kate Winslet|Leonardo DiCaprio|Frances Fisher|...,136,65,James Cameron
17669,24428,The Avengers,Some assembly required.,2012-04-25,Science Fiction|Action|Adventure,The Avengers Collection,en,220.0,1519.557910,Paramount Pictures|Marvel Studios,...,7.4,89.887648,143.0,When an unexpected enemy emerges and threatens...,English,<img src='http://image.tmdb.org/t/p/w185//RYMX...,Robert Downey Jr.|Chris Evans|Mark Ruffalo|Chr...,115,147,Joss Whedon
24812,135397,Jurassic World,The park is open.,2015-06-09,Action|Adventure|Science Fiction|Thriller,Jurassic Park Collection,en,150.0,1513.528810,Universal Studios|Amblin Entertainment|Legenda...,...,6.5,32.790475,124.0,Twenty-two years after the events of Jurassic ...,English,<img src='http://image.tmdb.org/t/p/w185//rhr4...,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,28,435,Colin Trevorrow

In [9]:
df.loc[14448]

id                                                                   19995
title                                                               Avatar
tagline                                        Enter the World of Pandora.
release_date                                                    2009-12-10
genres                            Action|Adventure|Fantasy|Science Fiction
belongs_to_collection                                    Avatar Collection
original_language                                                       en
budget_musd                                                          237.0
revenue_musd                                                   2787.965087
production_companies     Ingenious Film Partners|Twentieth Century Fox ...
production_countries               United States of America|United Kingdom
vote_count                                                         12114.0
vote_average                                                           7.2
popularity                                                      185.070892
runtime                                                              162.0
overview                 In the 22nd century, a paraplegic Marine is di...
spoken_languages                                           English|Español
poster_path              <img src='http://image.tmdb.org/t/p/w185//btnl...
cast                     Sam Worthington|Zoe Saldana|Sigourney Weaver|S...
cast_size                                                               83
crew_size                                                              153
director                                                     James Cameron
Name: 14448, dtype: object

__Movies Top 5 - Highest Budget__

In [13]:
df.nlargest(5,'budget_musd')[['title','budget_musd']]

                                             title  budget_musd
16986  Pirates of the Caribbean: On Stranger Tides        380.0
11743     Pirates of the Caribbean: At World's End        300.0
26268                      Avengers: Age of Ultron        280.0
10985                             Superman Returns        270.0
16006                                      Tangled        260.0

__Movies Top 5 - Highest Profit__

In [17]:
df['profit'] = df['revenue_musd'] - df['budget_musd']
df.nlargest(5,'profit')[['title','profit']]

                              title       profit
14448                        Avatar  2550.965087
26265  Star Wars: The Force Awakens  1823.223624
1620                        Titanic  1645.034188
24812                Jurassic World  1363.528810
28501                     Furious 7  1316.249360

__Movies Top 5 - Lowest Profit__

In [20]:
df.sort_values(by='profit',ascending = True)[['title','profit']].head(5)

                                             title      profit
20959                              The Lone Ranger -165.710090
7164                                     The Alamo -119.180039
16659                              Mars Needs Moms -111.007242
43611  Valerian and the City of a Thousand Planets -107.447384
2684                              The 13th Warrior  -98.301101

__Movies Top 5 - Highest ROI__

In [23]:
df['ROI'] = df['revenue_musd'] / df['budget_musd']
df.nlargest(5,'ROI')[['title','ROI']]

                         title           ROI
3965            Less Than Zero  1.239638e+07
3312              Modern Times  8.500000e+06
14270    Welcome to Dongmakgol  4.197477e+06
22041           Aquí Entre Nos  2.755584e+06
2284   The Karate Kid, Part II  1.018619e+06

__Movies Top 5 - Lowest ROI__

In [25]:
df.nsmallest(5,'ROI')[['title','ROI']]

                         title           ROI
6955           Chasing Liberty  5.217391e-07
8041               The Cookout  7.500000e-07
2636   Never Talk to Strangers  9.375000e-07
12859           To Rob a Thief  1.499133e-06
17381                 Deadfall  1.800000e-06

__Movies Top 5 - Most Votes__

In [31]:
df.nlargest(5,'vote_count')['vote_count']

15368    14075.0
12396    12269.0
14448    12114.0
17669    12000.0
26272    11444.0
Name: vote_count, dtype: float64

## Find your next Movie

3. __Filter__ the Dataset for movies that meet the following conditions:

__Search 1: Science Fiction Action Movie with Bruce Willis (sorted from high to low Rating)__

__Search 2: Movies with Uma Thurman and directed by Quentin Tarantino (sorted from short to long runtime)__

__Search 3: Most Successful Pixar Studio Movies between 2010 and 2015 (sorted from high to low Revenue)__

__Search 4: Action or Thriller Movie with original language English and minimum Rating of 7.5 (most recent movies first)__

In [24]:
mask_genre = df['genres'].str.contains('Science Fiction') & df['genres'].str.contains('Action')
mask_genre

0        False
1        False
2        False
3        False
4        False
         ...
44686    False
44687    False
44688    False
44689    False
44690    False
Name: genres, Length: 44691, dtype: bool

In [25]:
mask_actor = df['cast'].str.contains('Bruce Willis')
mask_actor

0        False
1        False
2        False
3        False
4        False
         ...
44686    False
44687    False
44688    False
44689    False
44690      NaN
Name: cast, Length: 44691, dtype: object

In [27]:
df.loc[mask_genre & mask_actor,['title','vote_average']].sort_values(by="vote_average",ascending=False)

                       title  vote_average
1448       The Fifth Element           7.3
19218                 Looper           6.6
1786              Armageddon           6.5
14135             Surrogates           5.9
20333  G.I. Joe: Retaliation           5.4
27619                   Vice           4.1

In [36]:
#Search 2: Movies with Uma Thurman and directed by Quentin Tarantino (sorted from short to long runtime)

mask_mov = df['cast'].str.contains('Uma Thurman')

In [37]:
mask_director = df['director'] == 'Quentin Tarantino'

In [39]:
df.loc[mask_mov & mask_director, ['runtime']].sort_values(by='runtime')

      runtime
6667    111.0
7208    136.0
291     154.0

In [70]:
#Most Successful Pixar Studio Movies between 2010 and 2015 (sorted from high to low Revenue)
pixar_mask = df.production_companies.str.contains("Pixar").fillna(False)

date_mask = df['release_date'].between('2010-01-01','2015-12-31')

In [71]:
df.loc[pixar_mask & date_mask,['title','revenue_musd']].sort_values(by='revenue_musd',ascending=False)

                            title  revenue_musd
15236                 Toy Story 3   1066.969703
29957                  Inside Out    857.611174
20888         Monsters University    743.559607
17220                      Cars 2    559.852396
18900                       Brave    538.983207
30388           The Good Dinosaur    331.926147
16392                 Day & Night           NaN
21694           The Blue Umbrella           NaN
21697        Toy Story of Terror!           NaN
22489                     La luna           NaN
24252           Hawaiian Vacation           NaN
24254                   Small Fry           NaN
25515             Partysaurus Rex           NaN
25516        The Legend of Mor'du           NaN
25517  Toy Story That Time Forgot           NaN
31803                        Lava           NaN
34560         Sanjay's Super Team           NaN
40259                   Air Mater           NaN
40675         Riley's First Date?           NaN

In [73]:
#Search 4: Action or Thriller Movie with original language English and minimum Rating of 7.5 (most recent movies first)

movie_mask = df['genres'].str.contains('Action') | df['genres'].str.contains('Thriller')

lan_mask = df['original_language'] == 'en'

rating_mask = df['vote_average'] >= 7 

avg_mask = df['vote_count'] >= 10

next_movie = df.loc[movie_mask & lan_mask & rating_mask & avg_mask, ["title", "genres", "vote_average", "vote_count", "release_date"]].sort_values(by='release_date',ascending=False).set_index('title')
next_movie

,genres,vote_average,vote_count,release_date
title,,,,
What Happened to Monday,Science Fiction|Thriller,7.3,598.0,2017-08-18
Wind River,Action|Crime|Mystery|Thriller,7.4,181.0,2017-08-03
Detroit,Thriller|Crime|Drama|History,7.3,67.0,2017-07-28
Descendants 2,TV Movie|Family|Action|Comedy|Music|Adventure,7.5,171.0,2017-07-21
Dunkirk,Action|Drama|History|Thriller|War,7.5,2712.0,2017-07-19
...,...,...,...,...
The General,Action|Adventure|Comedy|Drama,8.0,240.0,1926-12-31
He Who Gets Slapped,Drama|Romance|Thriller,7.2,15.0,1924-12-22
The Navigator,Action|Comedy,7.3,38.0,1924-10-13
The Thief of Bagdad,Action|Adventure|Drama|Family|Fantasy,7.4,37.0,1924-03-18
The Great Train Robbery,Action|Adventure|Western,7.1,116.0,1903-12-01

## Are Franchises more successful?

4. __Analyze__ the Dataset and __find out whether Franchises (Movies that belong to a collection) are more successful than stand-alone movies__ in terms of:

- mean revenue
- median Return on Investment
- mean budget raised
- mean popularity
- mean rating

hint: use groupby()

__Franchise vs. Stand-alone: Average Revenue__

In [7]:
df.groupby('belongs_to_collection')['revenue_musd'].mean()

belongs_to_collection
... Has Fallen Collection               183.390043
00 Schneider Filmreihe                         NaN
08/15 Collection                               NaN
100 Girls Collection                           NaN
101 Dalmatians (Animated) Collection    215.880014
                                           ...
Сказки Чуковского                              NaN
Чебурашка и крокодил Гена                      NaN
Что Творят мужчины! (Коллекция)                NaN
男はつらいよ シリーズ                                    NaN
식객 시리즈                                         NaN
Name: revenue_musd, Length: 1691, dtype: float64

__Franchise vs. Stand-alone: Return on Investment / Profitability (median)__

In [8]:
df['ROI'] = df['revenue_musd'].div(df.budget_musd)
df['ROI']

0        12.451801
1         4.043035
2              NaN
3         5.090760
4              NaN
           ...
44686          NaN
44687          NaN
44688          NaN
44689          NaN
44690          NaN
Name: ROI, Length: 44691, dtype: float64

In [10]:
df['franc'] = df['belongs_to_collection'].notna()
df['franc']

0         True
1        False
2         True
3        False
4         True
         ...
44686    False
44687    False
44688    False
44689    False
44690    False
Name: franc, Length: 44691, dtype: bool

In [11]:
df.groupby('ROI')['franc'].median()

ROI
5.217391e-07    0.0
7.500000e-07    0.0
9.375000e-07    0.0
1.499133e-06    0.0
1.800000e-06    0.0
               ...
1.018619e+06    1.0
2.755584e+06    0.0
4.197477e+06    0.0
8.500000e+06    0.0
1.239638e+07    0.0
Name: franc, Length: 5241, dtype: float64

__Franchise vs. Stand-alone: Average Budget__

In [12]:
df.groupby('franc')['budget_musd'].mean()

franc
False    18.047741
True     38.319847
Name: budget_musd, dtype: float64

__Franchise vs. Stand-alone: Average Popularity__

In [14]:
df.groupby('franc')['popularity'].mean()

franc
False    2.592726
True     6.245051
Name: popularity, dtype: float64

__Franchise vs. Stand-alone: Average Rating__

In [15]:
df.groupby('franc')['vote_average'].mean()

franc
False    6.008787
True     5.956806
Name: vote_average, dtype: float64

In [24]:
df.groupby('franc').agg({'budget_musd': ['mean','sum'], 'revenue_musd':['sum','mean','count','nunique']})

      budget_musd                  revenue_musd
             mean            sum            sum        mean count nunique
franc
False   18.047741  131243.173823  264251.059520   44.742814  5906    5466
True    38.319847   60621.998159  245082.416858  165.708193  1479    1444

## Most Successful Franchises

5. __Find__ the __most successful Franchises__ in terms of

- __total number of movies__
- __total & mean budget__
- __total & mean revenue__
- __mean rating__

In [28]:
df['belongs_to_collection'].value_counts()

The Bowery Boys                  29
Totò Collection                  27
Zatôichi: The Blind Swordsman    26
James Bond Collection            26
The Carry On Collection          25
                                 ..
Salt and Pepper Collection        1
Deadpool Collection               1
Ant-Man Collection                1
Elvira Collection                 1
Red Lotus Collection              1
Name: belongs_to_collection, Length: 1691, dtype: int64

In [31]:
df.sort_values(by='belongs_to_collection',ascending=False)['belongs_to_collection'].value_counts()

The Bowery Boys                          29
Totò Collection                          27
James Bond Collection                    26
Zatôichi: The Blind Swordsman            26
The Carry On Collection                  25
                                         ..
Old Way Collection                        1
Olsen Banden (Samling)                    1
Hot Wheels: AcceleRacers - Collection     1
Omae Umasou Da na                         1
Dreileben                                 1
Name: belongs_to_collection, Length: 1691, dtype: int64

In [34]:
franchises = df.groupby("belongs_to_collection").agg({"title":"count", "budget_musd": ["sum", "mean"], 
                                                      "revenue_musd": ["sum", "mean"],
                                                      "vote_average": "mean", "popularity": "mean",
                                                      "ROI":"median", 
                                                      "vote_count":"mean"})

In [35]:
franchises = df.groupby("belongs_to_collection").agg({"title":"count", "budget_musd": ["sum", "mean"], 
                                                      "revenue_musd": ["sum", "mean"],
                                                      "vote_average": "mean", "popularity": "mean",
                                                      "ROI":"median", 
                                                      "vote_count":"mean"})

In [38]:
franchises.nlargest(5,('budget_musd','sum'))

                                    title budget_musd              \
                                    count         sum        mean
belongs_to_collection
James Bond Collection                  26     1539.65   59.217308
Harry Potter Collection                 8     1280.00  160.000000
Pirates of the Caribbean Collection     5     1250.00  250.000000
The Fast and the Furious Collection     8     1009.00  126.125000
X-Men Collection                        6      983.00  163.833333

                                    revenue_musd             vote_average  \
                                             sum        mean         mean
belongs_to_collection
James Bond Collection                7106.970239  273.345009     6.338462
Harry Potter Collection              7707.367425  963.420928     7.537500
Pirates of the Caribbean Collection  4521.576826  904.315365     6.880000
The Fast and the Furious Collection  5125.098793  640.637349     6.662500
X-Men Collection                     2808.832317  468.138720     6.816667

                                    popularity       ROI   vote_count
                                          mean    median         mean
belongs_to_collection
James Bond Collection                13.453502  6.128922  1284.307692
Harry Potter Collection              26.253893  6.165086  5983.250000
Pirates of the Caribbean Collection  53.972237  3.453009  5016.000000
The Fast and the Furious Collection  10.799435  4.942154  3197.000000
X-Men Collection                      9.707541  3.023632  4593.833333

In [39]:
franchises.nlargest(5,('budget_musd','mean'))

                                    title budget_musd        revenue_musd  \
                                    count         sum   mean          sum
belongs_to_collection
Tangled Collection                      2       260.0  260.0   591.794936
Pirates of the Caribbean Collection     5      1250.0  250.0  4521.576826
The Avengers Collection                 2       500.0  250.0  2924.961604
The Hobbit Collection                   3       750.0  250.0  2935.523356
Man of Steel Collection                 2       475.0  237.5  1536.105712

                                                 vote_average popularity  \
                                            mean         mean       mean
belongs_to_collection
Tangled Collection                    591.794936     7.250000  12.319364
Pirates of the Caribbean Collection   904.315365     6.880000  53.972237
The Avengers Collection              1462.480802     7.350000  63.633534
The Hobbit Collection                 978.507785     7.233333  25.205614
Man of Steel Collection               768.052856     6.100000  24.987357

                                          ROI   vote_count
                                       median         mean
belongs_to_collection
Tangled Collection                   2.276134  1901.000000
Pirates of the Caribbean Collection  3.453009  5016.000000
The Avengers Collection              5.963190  9454.000000
The Hobbit Collection                3.833600  5981.333333
Man of Steel Collection              3.219510  6825.500000

## Most Successful Directors

6. __Find__ the __most successful Directors__ in terms of

- __total number of movies__
- __total revenue__

In [44]:
df.groupby('director').agg({'title':'count'}).sort_values(by='title',ascending=False).head(5)

                  title
director
John Ford            66
Michael Curtiz       65
Werner Herzog        54
Alfred Hitchcock     53
Woody Allen          49

In [48]:
df.groupby('director').agg({'revenue_musd':'sum'}).sort_values(by='revenue_musd',ascending=False).head(5)

                  revenue_musd
director
Steven Spielberg   9256.621422
Peter Jackson      6528.244659
Michael Bay        6437.466781
James Cameron      5900.610310
David Yates        5334.563196